<script>
  import Poll from "../../common/Poll.svelte";
  import Select, { Option } from "@smui/select";
  import Button, {Label} from '@smui/button';

  const cities = [
    "Москва",
    "Санкт-Петебург",
    "Абаза",
    "Абакан",
    "Абдулино",
    "Абинск",
    "Агидель",
    "Агрыз",
    "Адыгейск",
    "Азнакаево",
    "Азов",
    "Ак-Довурак",
    "Аксай",
    "Алагир",
    "Алапаевск",
    "Алатырь",
    "Алдан",
    "Алейск",
    "Александров",
    "Александровск",
    "Александровск-Сахалинский",
    "Кемь",
    "Кирсанов",
    "Киселёвск",
    "Кисловодск",
    "Краснокамск",
    "Красноперекопск",
    "Курганинск",
    "Курильск",
    "Курлово",
    "Куровское",
    "Курск",
    "Куртамыш",
    "Курчалой",
    "Курчатов",
    "Куса",
    "Кушва",
    "Кызыл",
    "Кыштым",
    "Кяхта",
    "Лабинск",
    "Лабытнанги",
    "Лагань",
    "Ладушкин",
    "Лаишево",
    "Лакинск",
    "Лангепас",
    "Лахденпохья",
    "Лебедянь",
    "Любим",
    "Людиново",
    "Лянтор",
    "Магадан",
    "Магас",
    "Магнитогорск",
    "Майкоп",
    "Майский",
    "Макаров",
    "Макарьев",
    "Макушино",
    "Малая Вишера",
    "Малгобек",
    "Малмыж",
    "Малоархангельск",
    "Малоярославец",
    "Мамадыш",
    "Мамоново",
    "Мантурово",
    "Мариинск",
    "Михайлов",
    "Михайловка",
    "Михайловск",
    "Михайловск",
    "Мичуринск",
    "Могоча",
    "Можайск",
    "Набережные Челны",
    "Навашино",
    "Наволоки",
    "Ясный",
    "Яхрома"
  ];

  let value;
  let selectValue;
</script>

<Poll
  title="Какой ты чиновник?"
  position="1"
  totalPosition="5"
  link="incom"
  back="../"
  value={value || selectValue}
  text="Привет! Прежде, чем получить ответ, нам нужно кое-что о тебе узнать. Откуда ты?">
  <Select
    variant="outlined"
    enhanced
    bind:value={selectValue}
    label="Регион, город..."
    class="demo-select-width"
    menu$class="demo-select-width">
    {#each cities as city}
      <Option value={city} selected={selectValue === city}>
        {city}
      </Option>
    {/each}
  </Select>
  <Button variant="raised" class={value === 'true' ? 'selected' : ''} on:click={() => {
    value = 'true';
    selectValue = null;
  }}>
    <Label>Сравнить меня со всеми чиновниками России</Label>
  </Button>
</Poll>
